{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_reviews", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 103], "dtype": "float32", "sparse": false, "name": "input_reviews"}, "inbound_nodes": []}, {"name": "input_attributes", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 102], "dtype": "float32", "sparse": false, "name": "input_attributes"}, "inbound_nodes": []}, {"name": "embedding_reviews_layer", "class_name": "Embedding", "config": {"name": "embedding_reviews_layer", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2949, "output_dim": 2949, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_reviews", 0, 0, {}]]]}, {"name": "embedding_attributes_layer", "class_name": "Embedding", "config": {"name": "embedding_attributes_layer", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2949, "output_dim": 2949, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_attributes", 0, 0, {}]]]}, {"name": "dropout_reviews", "class_name": "Dropout", "config": {"name": "dropout_reviews", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_reviews_layer", 0, 0, {}]]]}, {"name": "lstm_attributes", "class_name": "LSTM", "config": {"name": "lstm_attributes", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding_attributes_layer", 0, 0, {}]]]}, {"name": "lstm_reviews", "class_name": "LSTM", "config": {"name": "lstm_reviews", "trainable": true, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_reviews", 0, 0, {}], ["lstm_attributes", 0, 1, {}], ["lstm_attributes", 0, 2, {}]]]}, {"name": "output_layer", "class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "units": 2949, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_reviews", 0, 0, {}]]]}], "input_layers": [["input_attributes", 0, 0], ["input_reviews", 0, 0]], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}